"""**Завдання 1: Робота з функціями**

Створіть Python-файл з ім'ям `calculator.py`. У цьому файлі створіть наступні функції:

1. `add(a, b)`: Приймає два числа `a` і `b` та повертає їхню суму.
2. `subtract(a, b)`: Приймає два числа `a` і `b` та повертає їхню різницю.
3. `multiply(a, b)`: Приймає два числа `a` і `b` та повертає їхній добуток.
4. `divide(a, b)`: Приймає два числа `a` і `b` і повертає результат ділення `a` на `b`. Пам'ятайте про можливість ділення на нуль і додайте перевірку цього варіанту.

Після створення цих функцій, напишіть програму, яка імпортує модуль `calculator.py` і використовує його функції для виконання обчислень. Попросіть користувача ввести два числа і операцію (додавання, віднімання, множення або ділення), і виведіть результат обчислення."""

# Імпортуємо модуль calculator
from module import calculator

# Отримуємо вхідні дані від користувача
num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))
operation = input("Введіть операцію (+, -, *, /): ")

# Виконуємо обрану операцію
if operation == '+':
    result = calculator.add(num1, num2)
    print(f"Результат: {num1} + {num2} = {result}")
elif operation == '-':
    result = calculator.subtract(num1, num2)
    print(f"Результат: {num1} - {num2} = {result}")
elif operation == '*':
    result = calculator.multiply(num1, num2)
    print(f"Результат: {num1} * {num2} = {result}")
elif operation == '/':
    result = calculator.divide(num1, num2)
    print(f"Результат: {num1} / {num2} = {result}")
else:
    print("Помилка: невідома операція! Використовуйте +, -, * або /")